#  ____                     __ _ _        ____   ___ ____  _
# | __ ) _ __ _____      __/ _(_) | ___  |___ \ / _ \___ \/ |
# |  _ \| '__/ _ \ \ /\ / / |_| | |/ _ \   __) | | | |__) | |
# | |_) | | |  __/\ V  V /|  _| | |  __/  / __/| |_| / __/| |
# |____/|_|  \___| \_/\_/ |_| |_|_|\___| |_____|\___/_____|_|
#
# https://github.com/andreystarkov/Brewfile-2021

tap 'warrensbox/tap'
tap 'txn2/tap'
tap 'rcmdnk/rcmdnkpac'
tap 'rcmdnk/rcmdnkcask'
tap 'rcmdnk/file'
tap 'ldez/tap'
tap 'homebrew/services'
tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-drivers'
tap 'homebrew/bundle'
tap 'heroku/brew'
tap 'cjbassi/gotop'
tap 'buo/cask-upgrade'
tap 'buildpack/tap'
tap 'boz/repo'
tap 'beeftornado/rmtree'
brew 'dnsmasq'
brew 'percona-server'
brew 'php'
brew 'tor'
brew 'namebench'
cask 'ios-saver'
cask 'aerial'
cask 'fliqlo'
cask 'safari-technology-preview'
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-lovers'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zoxide'
brew 'zbar'
brew 'yq'
brew 'yarn'
brew 'xz'
brew 'xsv'
brew 'wine'
brew 'wifi-password'
brew 'wget'
brew 'wdiff'
brew 'watch'
brew 'visitors'
brew 'vim'
brew 'varnish'
brew 'unrar'
brew 'unison'
brew 'typespeed'
brew 'tree'
brew 'toilet'
brew 'tmux'
brew 'tmate'
brew 'tldr'
brew 'tig'
brew 'theora'
brew 'thefuck'
brew 'the_silver_searcher'
brew 'tfswitch'
brew 'tflint'
brew 'terragrunt'
brew 'terraform'
brew 'terraform-docs'
brew 'telnet'
brew 'syncthing'
brew 'svn'
brew 'starship'
brew 'ssh-copy-id'
brew 'sqlite'
brew 'source-highlight'
brew 'smenu'
brew 'sl'
brew 'skaffold'
brew 'sift'
brew 'shfmt'
brew 'shellcheck'
brew 'screenutf8'
brew 'screen'
brew 'rust'
brew 'ruby'
brew 'rpm'
brew 'ripgrep'
brew 'redis'
brew 'reattach-to-user-namespace'
brew 'readline'
brew 'rcmdnk-sshrc'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'rbenv-bundler'
brew 'qt5'
brew 'python3'
brew 'python2'
brew 'python@2'
brew 'python'
brew 'pv'
brew 'pstree'
brew 'pssh'
brew 'prototool'
brew 'protobuf'
brew 'proctools'
brew 'prm'
brew 'prettyping'
brew 'pre-commit'
brew 'postgresql'
brew 'mariadb', restart_service: true
cask 'db-browser-for-sqlite'
cask 'sequel-pro'
brew 'sqlite-analyzer'
cask 'dockertoolbox'
brew 'pkg-config'
brew 'pipenv'
brew 'pinentry-mac'
brew 'parse-plist'
brew 'parallel'
brew 'pango'
brew 'packer'
brew 'pack'
brew 'p7zip'
brew 'openssl'
brew 'openssh'
brew 'nvm'
brew 'nodenv'
brew 'node'
brew 'node-build'
brew 'nmap'
brew 'nginx'
brew 'neovim'
brew 'ncurses'
brew 'ncdu'
brew 'nagios'
brew 'mysql'
brew 'mtr'
brew 'monit'
brew 'mitmproxy'
brew 'minicom'
brew 'mercurial'
brew 'maven'
brew 'mas'
brew 'm-cli'
brew 'lynx'
brew 'lolcat'
brew 'libtool'
brew 'libtiff'
brew 'libpng'
brew 'libgphoto2'
brew 'less'
brew 'lcdf-typetools'
brew 'lazygit'
brew 'lazydocker'
brew 'kustomize'
brew 'kubernetes-helm'
brew 'kubernetes-cli'
brew 'kubefwd'
brew 'kubectx'
brew 'kube-ps1'
brew 'ko'
brew 'kail'
brew 'kafka'
brew 'k9s'
brew 'jq'
brew 'jpeg'
brew 'jp2a'
brew 'john-jumbo'
brew 'java'
brew 'interactive-rebase-tool'
brew 'imagemagick'
brew 'iftop'
brew 'icdiff'
brew 'hugo'
brew 'hub'
brew 'httpd'
brew 'httpie'
brew 'htop'
brew 'howdoi'
brew 'hg'
brew 'heroku'
brew 'gti'
brew 'grv'
brew 'grep'
brew 'grc'
brew 'graphicsmagick'
brew 'gradle'
brew 'gox'
brew 'go'
brew 'gnutls'
brew 'gnupg'
brew 'gnu-which'
brew 'gnu-time'
brew 'gnu-tar'
brew 'gnu-sed'
brew 'gnu-indent'
brew 'gnu-getopt'
brew 'gmp'
brew 'glib'
brew 'git'
brew 'git-secrets'
brew 'git-now'
brew 'git-multipush'
brew 'git-lfs'
brew 'git-gerrit'
brew 'git-ftp'
brew 'git-flow'
brew 'git-extras'
brew 'git-cola'
brew 'git '
brew 'gettext'
brew 'geektool'
brew 'gdb'
brew 'gdb  '
brew 'gcc'
brew 'gawk'
brew 'fzf'
brew 'freetype'
brew 'fortio'
brew 'foremost'
brew 'fontconfig'
brew 'flac'
brew 'fish'
brew 'findutils'
brew 'ffmpegthumbnailer'
brew 'ffmpeg2theora'
brew 'ffmpeg'
brew 'fd'
brew 'exiftool'
brew 'exiftags'
brew 'exif'
brew 'exa'
brew 'entr'
brew 'emacs-plus'
brew 'eg-examples'
brew 'dust'
brew 'dog'
brew 'docker'
brew 'docker-machine'
brew 'docker-machine-driver-hyperkit'
brew 'docker-compose'
brew 'direnv'
brew 'diff-so-fancy'
brew 'desktop-file-utils'
brew 'ctop'
brew 'corkscrew'
brew 'coreutils'
brew 'consul'
brew 'colordiff'
brew 'cmake'
brew 'chafa'
brew 'cfssl'
brew 'ccat'
brew 'carthage'
brew 'cairo'
brew 'brew-file'
brew 'brew-cask-completion'
brew 'boot2docker'
brew 'boost'
brew 'bfg'
brew 'bats'
brew 'bats-core'
brew 'bat'
brew 'bash'
brew 'bash-completion'
brew 'awscli'
brew 'autossh'
brew 'automake'
brew 'autojump'
brew 'autoconf'
brew 'asdf'
brew 'asciinema'
brew 'ant'
brew 'ansible'
brew 'yarn'
brew 'ag'
brew 'ack'
cask 'zoomus'
cask 'yakyak'
cask 'xquartz'
cask 'xee'
cask 'wireshark'
cask 'webstorm'
cask 'webpack-dashboard'
# cask 'vscodium'
cask 'vlc'
cask 'visual-studio-code'
cask 'visual-studio-code-insiders'
cask 'vip-access'
cask 'vectr'
cask 'unity-web-player'
cask 'tunnelblick'
cask 'transmission'
cask 'todos'
cask 'telegram'
cask 'teamviewer'
cask 'tad'
cask 'synergy'
cask 'suspicious-package'
cask 'superduper'
cask 'steam'
cask 'spotify'
cask 'sourcetree'
cask 'slack'
cask 'skype'
cask 'shotcut'
cask 'shortcat'
cask 'sequential'
cask 'rescuetime'
cask 'rectangle'
cask 'recordit'
cask 'quicksilver'
cask 'qlcolorcode'
cask 'private-internet-access'
cask 'postman'
cask 'plex-media-player'
cask 'paw'
cask 'paparazzi'
cask 'p4v'
cask 'opera'
cask 'open-in-code'
cask 'onyx'
cask 'obs'
cask 'obs-virtualcam'
cask 'ngrok'
cask 'mojibar'
cask 'menubargmail'
cask 'macvim'
cask 'macdown'
cask 'loopback'
cask 'little-snitch'
cask 'linkliar'
cask 'launchy'
cask 'krita'
cask 'kodi'
cask 'keybase'
cask 'karabiner-elements'
cask 'kap'
cask 'jumpcut'
cask 'joinme'
cask 'iterm2'
cask 'insomnia'
cask 'inky'
cask 'inkscape'
cask 'hyperswitch'
cask 'hyper'
cask 'homebrew/cask-fonts/font-ubuntu'
cask 'homebrew/cask-fonts/font-ubuntu-mono-derivative-powerline'
cask 'homebrew/cask-fonts/font-source-han-noto-cjk'
cask 'homebrew/cask-fonts/font-source-code-pro'
cask 'homebrew/cask-fonts/font-source-code-pro-for-powerline'
cask 'homebrew/cask-fonts/font-simple-line-icons'
cask 'homebrew/cask-fonts/font-roboto'
cask 'homebrew/cask-fonts/font-roboto-mono-for-powerline'
cask 'homebrew/cask-fonts/font-open-sans'
cask 'homebrew/cask-fonts/font-open-sans-condensed'
cask 'homebrew/cask-fonts/font-noto-mono-for-powerline'
cask 'homebrew/cask-fonts/font-nanum-myeongjo'
cask 'homebrew/cask-fonts/font-nanum-gothic'
cask 'homebrew/cask-fonts/font-nanum-gothic-coding'
cask 'homebrew/cask-fonts/font-monofur-for-powerline'
cask 'homebrew/cask-fonts/font-meslo-for-powerline'
cask 'homebrew/cask-fonts/font-menlo-for-powerline'
cask 'homebrew/cask-fonts/font-material-icons'
cask 'homebrew/cask-fonts/font-liberation-mono-for-powerline'
cask 'homebrew/cask-fonts/font-jetbrains-mono'
cask 'homebrew/cask-fonts/font-ionicons'
cask 'homebrew/cask-fonts/font-inconsolata'
cask 'homebrew/cask-fonts/font-inconsolata-for-powerline'
cask 'homebrew/cask-fonts/font-hack'
cask 'homebrew/cask-fonts/font-fontawesome'
cask 'homebrew/cask-fonts/font-fira-mono'
cask 'homebrew/cask-fonts/font-fira-mono-for-powerline'
cask 'homebrew/cask-fonts/font-fira-code'
cask 'homebrew/cask-fonts/font-droid-sans-mono-for-powerline'
cask 'homebrew/cask-fonts/font-devicons'
cask 'homebrew/cask-fonts/font-dejavu-sans-mono-for-powerline'
cask 'homebrew/cask-fonts/font-dashicons'
cask 'homebrew/cask-fonts/font-d2coding'
cask 'homebrew/cask-fonts/font-consolas-for-powerline'
cask 'homebrew/cask-fonts/font-anonymice-powerline'
cask 'harvest'
cask 'google-hangouts'
cask 'google-drive-file-stream'
cask 'google-cloud-sdk'
cask 'google-chrome'
cask 'goland'
cask 'gitup'
cask 'gitter'
cask 'gitkraken'
cask 'github'
cask 'gfxcardstatus'
cask 'ganttproject'
cask 'freeplane'
cask 'font-source-serif-pro'
cask 'font-source-sans-pro'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-roboto'
cask 'font-powerline-symbols'
cask 'font-open-sans'
cask 'font-migu1m'
cask 'font-lato'
cask 'font-hack-nerd-font'
cask 'font-fira-code'
cask 'font-consolas-for-powerline'
cask 'font-cascadia'
cask 'font-awesome-terminal-fonts'
cask 'flux'
cask 'fluid'
cask 'flip4mac'
cask 'flic'
cask 'firefox'
cask 'firefox-developer-edition'
cask 'evernote'
cask 'eqmac'
cask 'elgato-stream-deck'
cask 'elgato-control-center'
cask 'duet'
cask 'dropbox'
cask 'drawio'
cask 'docker-edge'
cask 'docker '
cask 'discord'
cask 'datagrip'
cask 'dash'
cask 'cooviewer'
cask 'configure-application-dock-tile'
cask 'commandq'
cask 'codekit'
cask 'coconutbattery'
cask 'clipy'
cask 'chefdk'
cask 'cheatsheet'
cask 'ccmenu'
cask 'ccleaner'
cask 'calibre'
cask 'cakebrew'
cask 'caffeine'
cask 'brave-browser'
cask 'bitwarden'
cask 'bettertouchtool'
cask 'bartender'
cask 'balsamiq-mockups'
cask 'backuploupe'
cask 'backblaze-downloader'
cask 'aws-vault'
cask 'authy'
cask 'atext'
cask 'arq'
cask 'appcleaner'
cask 'apache-directory-studio'
cask 'anki'
cask 'android-platform-tools'
cask 'android-file-transfer'
cask 'alfred'
cask 'airserver'
cask 'airfoil'
cask 'adventure'
cask 'adoptopenjdk8'
cask 'adobe-acrobat-reader'
cask '1password'